import React from 'react';
import './HomePage.css';
import { Header } from '../../components/Header/Header';

const Home = () => {
  return (

    <>
      <Header />
      <section className="home-container">
        <h1 className="title">Ласкаво просимо до CampAway!</h1>
        <p className="subtitle">Ваші пригоди чекають на вас!</p>
        <div className="services">
          <h2 className="section-title">Оренда камперів в Україні</h2>
          <p>
            Поїздка кампером - це свобода, пригода та незабутні враження. Вирушайте в подорож Україною, насолоджуйтесь природою та відкривайте нові місця разом з CampAway!
          </p>
          <ul>
            <li>Широкий вибір комфортних та надійних камперів</li>
            <li>Простий процес бронювання та узгодження</li>
            <li>24/7 підтримка клієнтів для вашого спокою</li>
            <li>Ідеальне поєднання якості та доступності</li>
          </ul>
          <h3 className="sub-section-title">Як це працює?</h3>
          <ol>
            <li><strong>Оберіть свій кампер:</strong> Перегляньте нашу колекцію та оберіть ідеальний кампер для вашої подорожі.</li>
            <li><strong>Забронюйте:</strong> Зручний онлайн-процес бронювання дозволить вам швидко забронювати ваш кампер.</li>
            <li><strong>Відправляйтеся в подорож:</strong> Отримайте ключі та насолоджуйтесь вашою подорожжю без обмежень!</li>
          </ol>
          <p>Готові відправитися в подорож? Зв'яжіться з нами для отримання більш детальної інформації або забронюйте свій кампер прямо зараз!</p>
          <div className="contact-info">
            <p>Телефон: +380123456789</p>
            <p>Електронна пошта: info@campaway.com</p>
          </div>
          <p className="footer-text">Приготуйтеся до найкращих моментів вашого життя з CampAway!</p>
        </div>
      </section>
    </>
  );
}

export default Home;
